In [1]:
import mimicfouretl.bigquery_utils as bq
import mimicfouretl.analysis_utils as au

In [2]:
spark = bq.get_spark_session(use_local_data=True)

24/03/28 21:28:36 WARN Utils: Your hostname, Dunyas-Laptop.local resolves to a loopback address: 127.0.0.1; using 10.0.0.117 instead (on interface en0)
24/03/28 21:28:36 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
24/03/28 21:28:36 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
24/03/28 21:28:36 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

In [3]:
result = au.get_item_frequency(spark, 'itemid', 'mimiciv_hosp.labevents', item_id='50868', limit=10, use_local_data=True)
result.toPandas()

GENERATED QUERY:
 SELECT itemid, COUNT(*) as count FROM `mimiciv_hosp.labevents` WHERE itemid = '50868' GROUP BY itemid LIMIT 10

24/03/28 21:28:42 WARN SparkStringUtils: Truncated the string representation of a plan since it was too large. This behavior can be adjusted by setting 'spark.sql.debug.maxToStringFields'.

SELECT itemid, COUNT(*) as count FROM `labevents` WHERE itemid = '50868' GROUP BY itemid LIMIT 10

   itemid  count
0   50868     70

In [4]:
result = au.get_outcomes_by_item(spark, '50868', 'itemid', 'mimiciv_hosp.labevents', 'itemid', 'mimiciv_icu.inputevents', use_local_data=True)
result.toPandas()

GENERATED QUERY:

    SELECT A.subject_id, A.hadm_id, A.itemid AS item_value, B.itemid AS outcome_value
    FROM `mimiciv_hosp.labevents` A
    JOIN `mimiciv_icu.inputevents` B ON A.subject_id = B.subject_id AND A.hadm_id = B.hadm_id
    WHERE A.itemid = '50868'


    SELECT A.subject_id, A.hadm_id, A.itemid AS item_value, B.itemid AS outcome_value
    FROM `labevents` A
    JOIN `inputevents` B ON A.subject_id = B.subject_id AND A.hadm_id = B.hadm_id
    WHERE A.itemid = '50868'

      subject_id     hadm_id  item_value  outcome_value
0       16913836  25000857.0       50868         226364
1       16913836  25000857.0       50868         228341
2       16913836  25000857.0       50868         227523
3       16913836  25000857.0       50868         227522
4       16913836  25000857.0       50868         227522
...          ...         ...         ...            ...
5040    16913836  25000857.0       50868         225943
5041    16913836  25000857.0       50868         225943
5042    16913836  25000857.0       50868         225942
5043    16913836  25000857.0       50868         225154
5044    16913836  25000857.0       50868         220949

[5045 rows x 4 columns]